Revit 2027 API
FabricationPart.GetOptionCount Method
 Gets the number of fabrication options for this part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetOptionCount()
Public Function GetOptionCount As Integer
public:
int GetOptionCount()
member GetOptionCount : unit -> int
Return Value
Int32
 0 if the part has no option data exposed in Revit.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace